/* Задача 36
 Задайте массив вещественных чисел. 
 Найдите разницу между максимальным 
 и минимальным элементов массива.*/

double[] array = new double [7];
for (int i = 0; i < array.Length ; i++)
    array[i] = new Random().Next(100) / 10.0;
double max = array [0];
double min = array [0];

for (int i = 1; i < array.Length; i ++)
    if (array[i] > max)
        
for (int i = 0; i < array.Length; i++)
    Console.Write($"{array[i]} ");
Console.Write($"-> {k}");

 
